Revit 2024 API
ParameterTypeId.RbsElecShortCircuitRating Property
 "Short Circuit Rating"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RbsElecShortCircuitRating { get; }
Visual Basic
Public Shared ReadOnly Property RbsElecShortCircuitRating As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RbsElecShortCircuitRating {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace